# IsVirtual Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PrintManager..::..IsVirtual Property
PrintManager Class See Also
---
The virtual type in Autodesk Revit.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public VirtualPrinterType IsVirtual { get; }
```

Visual Basic
---
```text
Public ReadOnly Property IsVirtual As VirtualPrinterType
	Get
```

Visual C++
---
```text
public:
property VirtualPrinterType IsVirtual {
	VirtualPrinterType get ();
}
```

# See Also
PrintManager Class
Autodesk.Revit.DB Namespace